manuscript/review-comments.org
#+TITLE: Response to reviewers
#+Author: Anders Munch and Thomas A. Gerds
#+Date: \today
#+OPTIONS:   num:nil toc:nil ':t ^:t



We thank the the reviewers for their useful comments. We have
incorporated their suggestions into the manuscript, and we find it
much improved. Please see our point-to-point responses below.

Quotes from the old version of the manuscript is inserted in
@@latex:{\color{red} red}@@ boxes, quotes from the updated manuscript
is inserted in @@latex:{\color{gray} gray}@@ boxes, and when relevant
newly added text is show in @@latex:{\color{blue} blue}@@.


