manuscript/review-comments.tex
% Created 2025-10-30 tor 17:19
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper,danish]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{natbib, dsfont, enumitem, amssymb,
soul,xcolor,amsmath,graphicx,subcaption,verbatim,pgfplots,tikz,prodint,pgfpages, caption}
\usetikzlibrary{calc,patterns,angles,quotes,automata, positioning,arrows,shapes}
\definecolor{linkcolor}{rgb}{0, 0, 0.54}
\hypersetup{colorlinks=true,allcolors=linkcolor,linktocpage=true}
\bibliographystyle{abbrvnat}
% Handling new lines
\setlength{\parskip}{1em}
\setlength{\parindent}{0em}

% Handling space after sections
\usepackage{titlesec}
\titlespacing*{\section}{0em}{2em}{0em}
\titlespacing*{\subsection}{0em}{2em}{0em}
\titlespacing*{\subsubsection}{0em}{2em}{0em}

% No spacing after in start of list
\setlist[itemize]{topsep=0pt}
\setlist[enumerate]{topsep=0pt}
% Todo and notes
\usepackage[author=]{fixme}
\fxusetheme{color}
\definecolor{fxtarget}{rgb}{.5,.5,.5}
\definecolor{fxnote}{rgb}{.5,.5,.5}
\fxsetup{status=draft}
\newcommand{\E}{{\ensuremath{\mathop{{\mathbb{E}}}}}}
\newcommand{\R}{\mathbb{R}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\blank}{\makebox[1ex]{\textbf{$\cdot$}}}
\newcommand\independent{\protect\mathpalette{\protect\independenT}{\perp}}
\def\independenT#1#2{\mathrel{\rlap{$#1#2$}\mkern2mu{#1#2}}}
\renewcommand{\phi}{\varphi}
\renewcommand{\epsilon}{\varepsilon}
\newcommand*\diff{\mathop{}\!\mathrm{d}}
\newcommand{\weakly}{\rightsquigarrow}
\newcommand\smallO{\textit{o}}
\newcommand\bigO{\textit{O}}
\newcommand{\midd}{\; \middle|\;}
\newcommand{\1}{\mathds{1}}
\usepackage{ifthen} %% Empirical process with default argument
\newcommand{\G}[2][n]{{\ensuremath{\mathbb{G}_{#1}}{\left[#2\right]}}}
\DeclareMathOperator*{\argmin}{\arg\!\min}
\DeclareMathOperator*{\argmax}{\arg\!\max}
\newcommand{\V}{\mathrm{Var}} % variance
\newcommand{\eqd}{\stackrel{d}{=}} % equality in distribution
\newcommand{\arrow}[1]{\xrightarrow{\; {#1} \;}}
\newcommand{\arrowP}{\xrightarrow{\; P \;}} % convergence in probability
\newcommand{\KL}{\ensuremath{D_{\mathrm{KL}}}}
\newcommand{\leb}{\lambda} % the Lebesgue measure
\DeclareMathOperator{\TT}{\Psi} % target parameter
\newcommand{\empmeas}{\ensuremath{\mathbb{P}_n}} % empirical measure
\usepackage{tcolorbox}
\newcommand{\qrev}[1]{
\vspace{.5em}
\begin{tcolorbox}[boxrule=0pt]
\hfill{\it\footnotesize Quote from revised manuscript}\\[.5em]
#1
\end{tcolorbox}
}
\newcommand{\qold}[1]{
\vspace{.5em}
\begin{tcolorbox}[boxrule=0pt,colback=pink]
\hfill{\it\footnotesize Quote from old version of manuscript}\\[.5em]
#1
\end{tcolorbox}
}
\newcommand{\answer}[1]{{\vspace{1em}{\bf #1}\vspace{1em}}}
\author{Anders Munch and Thomas A. Gerds}
\date{\today}
\title{Response to reviewers}
\begin{document}

\maketitle
We thank the the reviewers for their useful comments. We have
incorporated their suggestions into the manuscript, and we find it
much improved. Please see our point-to-point responses below.

Quotes from the old version of the manuscript is inserted in
{\color{red} red} boxes, quotes from the updated manuscript
is inserted in {\color{gray} gray} boxes, and when relevant
newly added text is show in {\color{blue} blue}.
