manuscript/review-comments.org
* Reviewer 1

Comments to the Author

This paper proposes a super learner-style estimator of conditional
cumulative hazard functions in the context of right-censored
time-to-event data with competing risks. The user specifies libraries
of candidate estimators of the conditional cumulative hazards of the
event, censoring, and competing risk times. The proposed method then
selects the element of the product of these libraries that has the
smallest cross-validated empirical risk, where the risk is based on a
carefully constructed loss function. A key benefit of the proposed
methods over alternatives is that it jointly estimates the three
cumulative hazards, rather than iterating between estimation of them
or requiring a pre-specified censoring survival estimator. The authors
provided an oracle inequality demonstrating that the true risk of the
estimator is no worse than a constant multiple of the oracle risk up
to a logarithmic penalty in the size of the library. The authors also
provide numerical studies and a simulation illustrating the good
performance of the proposed method.

Overall, this is a nice contribution to the literature, and I am
grateful to the authors for the methods and accompanying theory. The
paper is well written and careful, though I think more effort could
be made in parts to make the notation somewhat more accessible. In
particular, an outline of the proposed algorithm in its totality
would be useful for readers.

#+begin_export latex
 \answer{Thank you for this comment, we agree that it is a good
idea with an outline of the proposed algorithm. We have added a
pseudo-algorithm to the paper.}
#+end_export

1. I have two main comments. My first comment regards a sentence in
   the discussion: ``A potential drawback of our approach is that we
   are evaluating the loss of the learners on the level of the
   observed data distribution, while the target of the analysis is
   either the event-time distribution, or the censoring distribution,
   or both.” I didn’t quite catch this on a first read-through of the
   paper, but I think it is an important point that deserves to be
   emphasized more throughout the paper. Specifically, this makes me
   wonder about the relevance of the oracle inequalities in
   Proposition 2 and Corollary 3: do we actually care about these
   risks? I usually care about inequalities and rates of convergence
   of the conditional survival (or cumulative hazard) function of the
   event time, censoring time, and competing risk. If I understand the
   above comment correctly, the risk considered in the paper doesn’t
   directly give such inequalities and rates. Is that correct? If so,
   it deserves to be mentioned and at least briefly discussed in the
   section on theoretical results. Similarly, this makes me question
   the relevance of the IPA metric considered in the numerical
   study. How do the different algorithms compare in terms of
   pointwise or integrated error for the conditional survival or
   cumulative hazard functions?

   #+begin_export latex
      \answer{This is an important point, which we agree should be made
	clear in the paper. We have added the following paragraph discussing
	this point at the end of Section 5.}

	\qrev{The norm defined in equation~(\ref{eq:norm}) operates on functions
	\( F \) which are features of the observed data distribution. This
	means that Proposition~\ref{prop:oracle-prop} and
	Corollary~\ref{cor:asymp-cons} provide guarantees in terms of a how
	well the function $\hat{\phi}_n$ predicts the observed data. Ideally,
	we would like performance guarantees for, e.g., the selected learners
	$\hat{\Lambda}_{jn}$ or the derived risk-prediction learner
	$\hat{Q}_{n}$ defined in equation~(\ref{eq:cs-risk-def}). There is a
	one-to-one correspondence between the learner $\hat{\phi}_n$ and the
	tuple of learners
	\((\hat \Lambda_{1n},\hat \Lambda_{2n}, \hat \Gamma_{n})\) through
	equations~(\ref{eq:lambdaj})-(\ref{eq:gamma}) and
	(\ref{eq:transition}), and we expect that the performance guarantees
	provided for $\hat{\phi}_n$ will in many cases translate into similar
	performance guarantees for each element of the tuple
	\((\hat \Lambda_{1n},\hat \Lambda_{2n}, \hat \Gamma_{n})\). We do not
	investigate this further theoretically, but investigate is empirically
	in our numerical experiments in Section~\ref{sec:numer-exper}.}

	\answer{We have also added the following reflection to the discussion in Section 8 (new
	  text in \color{blue}{blue}.)}.

	\qrev{A potential drawback of our approach
	is that we are evaluating the loss of the learners on the level of the
	observed data distribution, while the target of the analysis is either
	the event-time distribution, or the censoring distribution, or
	both. \color{blue}{Our numerical experiments suggest that our approach does provide
	estimates of the conditional survival functions which perform well,
	also when the predictive performance is measured against the true
	survival function with no censoring present.}}
     
     \answer{In the numerical studies, we in fact do use the IPA for the
       risk prediction model (1 $-$ the conditional survival function) of
       interest. We have now attempted to make this clearer by updating the
       following paragraph in Section 6:}

     \qold{Each super learner provides a learner for the cumulative hazard
       function for the outcome of interest. From the cumulative hazard
       function, we obtain a risk prediction model as described in
       Section~4, with the special
       case of $\Lambda_2 = 0$. We measure the performance of each super
       learner by calculating the index of prediction accuracy (IPA)
       \citep{kattan2018index} at a fixed time horizon (36 months) for the
       risk prediction model provided by the super learner. The IPA is 1
       minus the ratio between the model's Brier score and the null model's
       Brier score, where the null model is the model that does not use any
       covariate information. The value of IPA is approximated using a
       large (\( n = 20,000 \)) independent data set of uncensored data. }

     \qrev{Each super learner provides a learner for the cumulative hazard
     function for the outcome of interest. From the cumulative hazard
     function, we obtain a risk prediction model as described in
     Section~\ref{sec:joint-survival-super-learner}, see in particular
     equation~(\ref{eq:cs-risk-def}) with the special case of
     $\Lambda_2 = 0$. We
     measure the performance of the risk prediction model provided by each
     super learner by calculating the index of prediction accuracy (IPA)
     (Kattan and Gerds, 2018) at a fixed time horizon (36 months) for the
     risk prediction model provided by the super learner. For a risk
     prediction model \( r \colon \mathcal{X} \rightarrow [0,1] \), IPA at
     time \( \tau \) is
     \begin{equation*}
       1 - \frac{\E_Q{[(r(X) - \1{\{T \leq \tau\}})^2]}}
       {\E_Q{[( Q{({T \leq \tau})} - \1{\{T \leq \tau\}})^2]}}.
     \end{equation*}
     We chose IPA as a performance measure because it is proper,
     incorporates both discrimination and calibration, and is easy to
     interpret as it measures the relative performance gain compared to
     the null model which does not use any baseline information. The
     definition of IPA involves the uncensored survival time \( T \),
     which is not available in practice. However, in the numerical
     studies, this quantity is available because we know the
     data-generating mechanism used to generate \( T \). In practice, we
     Monte Carlo approximate the IPA by generating a large
     (\( n = 20,000 \)) independent data set of uncensored survival
     times, and calculate the empirical version of the IPA in there.}
  #+end_export

2. Second, and more minor, I wonder if the authors could expand on why
   it is difficult to extend the method to an ensemble estimator in
   this setting.

   #+begin_export latex
   \answer{Thank you for this comment. We do not believe that it needs to
     be particularly difficult, but there are at least two strategies
     that could be pursued, and we think that some additional thought on
     this is needed. We have expanded on this in the discussion by
     updating the following paragraph:}

   \qold{
   We have focused on a discrete version of the joint survival super
   learner, but it is of interest to extend the method to a proper
   ensemble learner, where learners are combined, e.g., through
   stacking. How an ensemble should be build for tuples of learners is an
   interesting topic for future research.
   }

   \qrev{
   We have focused on a discrete version of the joint survival super
   learner, but it is of interest to extend the method to a proper
   ensemble learner, where learners are combined, e.g., through
   stacking. There are at least two possible directions for constructing
   an ensemble version of the joints survival super leaner. One option is
   to construct a single convex combination of the F-learners
   \( \phi \in \Phi(\mathcal{A}_1, \mathcal{A}_2, \mathcal{B})
   \). Another, perhaps more interesting option, is to construct
   three separate convex combinations of the learners in
   \( \mathcal{A}_1 \), \( \mathcal{A}_2 \), and \( \mathcal{B} \).  How
   such an ensemble should be build and implemented is an interesting
   topic for future research.
   }
   #+end_export





