manuscript/review-comments.tex





\section*{Reviewer 2}
\label{sec:org498478f}

Section 3:

\begin{itemize}
\item P5. The point that the partial log-likelihood does not work well as
an evaluation criterion is interesting and warrants further
elaboration. An additional sentence explaining this point would be
helpful. Additionally, I wonder if this problem can be circumvented
in other ways: perhaps models that normally yield piecewise constant
hazards could be included in a slightly modified form with smoothed
hazards. What would be the consequences of this approach?

\answer{We agree that this is an important point, and we have
  elaborated further. It is an interesting idea to attempt to smooth
  the problematic piecewise constant cumulative hazard functions. We
  believe that this introduces other issues that would have to be
  addressed, and we briefly reflect on that now. Please see the
  updated paragraph below with new text in \color{blue}{blue}.}

\qrev{However, the partial
  log-likelihood loss does not work well as a general purpose measure
  of performance in hold-out samples when data are observed in
  continuous time. The reason is that the partial log-likelihood
  assigns an infinite value to any learner that predicts piecewise
  constant cumulative hazard functions, if the test set contains event
  times that are not observed in the training set. \color{blue}For
    instance, if no competing risks are present, a piecewise constant
    cumulative hazard function postulates a model for the distribution
    of the survival times where all probability is assigned to the
    finite number of time points at which the cumulative hazard
    function jumps. The likelihood according to such a model is zero
    at almost all time points, and thus the likelihood of any hold-out
    sample will almost surely be zero when data are observed in
    continuous time. \color{black} This problem occurs with prominent survival
  learners including the Kaplan-Meier estimator, random survival
  forests, and semi-parametric Cox regression models, and these
  learners cannot be included in the library of the super learner
  proposed by Polley and van der Laan (2011). \color{blue}{One might
  attempt to resolve this issue by smoothing an estimated
    cumulative hazard functions to obtain an estimate of the hazard
    function itself. This is a theoretically unattractive approach, as
    estimation of a hazard function is much harder than estimation of
    a cumulative hazard function. In practice, this approach would
    also introduces the additional problem of tuning a smoothing
    parameter, which may be infeasible for more complicated estimators
    like random survival forest, where the smoothing would have to be
    done conditional on baseline covariates.}  }
\end{itemize}


Section 4:

\begin{itemize}
\item P5. I find the notation using ``1'' for the indicator function
difficult to read, especially when preceded by other numerals. Why
not use I, δ, or a bold or blackboard/double-struck 1?

\answer{Thank you for this comment. The blackboard/double-struck was
  lost when converting to the journal's template, and we have now
  corrected that.}
\end{itemize}


\begin{itemize}
\item P6. The manuscript explains that it is in principle fairly easy to
use the survival package to estimate libraries of models for A₁, A₂,
and B. The practical value of the article would improve with a web
appendix showing code implementing this for the prostate cancer
study data.

\answer{A code supplement is provided at the Github repository that is
  referenced at the end of the Introduction. We have now added an
  example that demonstrates how tools from the survival package can be
  used to construct learners. We cannot share the original data, but we
  share an emulated data set and demonstrate how the joint survival
  super learner can be fitted to the data at the referenced Github
  repository.}
\end{itemize}


Section 5:

\begin{itemize}
\item P8. You state that a sensible objective function must be
proper. While I don't disagree, this point often generates
discussion. One might argue that in certain problems, our objective
need not be the correct recovery of the probability
distribution. Rather, we may want to predict outcomes at specific
time points while incorporating relative costs of incorrect
predictions. It's not clear that using probabilities as an
intermediate step is always optimal, especially when these are
estimated with error. Furthermore, while a proper loss function
might be optimal with large sample sizes, this may not hold for
finite samples. More discussion of this point would be valuable.

Answer notes: We now discuss utility / cost benefit. unclear what is
meant by finite sample problem of proper loss but penalized
likelihood is a good example.

\item P8. The authors quickly move from using proper scoring rules to the
Brier score, which feels less general. Are the results expected to
hold for other proper scoring rules?

Answer notes: yes, what other proper scoring rules are there? is
there an integrated deviance (log - score) maybe in Putter's book?

\item P9. At the top of the page, it's argued that the oracle inequality
provides insights into how the number of folds, time horizon, and
number of learners influence performance. Could the practical
utility of this be illustrated in the context of the prostate cancer
example?

Answer notes: no, but we have now added a comment about
this.. Unclear how to address this, because I do not believe there
is any actual practical utility to be gained from the types of
inequalities. Hmm, maybe we could say something about that in this
case, our analyses indicates that fairly complex models are used. If
this is true, our finite sample inequality shows that, for large
enough samples, the error rate will be dominated by that flexible
models and not by the cross-validation estimation step -- refer to
that we seem to be in case (b) of Corollary 3.

\item P10. The performance will be specified using the IPA, which needs
more discussion. Please briefly state how it is defined and why it
was chosen. (Is the IPA itself proper? If not, does this still make
sense here? Do we need other metrics as well?)


\answer{We have now defined the IPA explicitly, please see our
  response to Reviewer 1's first. The IPA is just a scaled version of the Brier score so it
  is indeed proper.}

% \qold{The IPA is 1
% minus the ratio between the model's Brier score and the null model's
% Brier score, where the null model is the model that does not use any
% covariate information. The value of IPA is approximated using a large
% (\( n = 20,000 \)) independent data set of uncensored data.}

% \qrev{For a risk
% prediction model \( r \colon \mathcal{X} \rightarrow [0,1] \), IPA at
% time \( \tau \) is
% \begin{equation*}
%   1 - \frac{\E_Q{[(r(X) - \1{\{T \leq \tau\}})^2]}}
%   {\E_Q{[( Q{({T \leq \tau})} - \1{\{T \leq \tau\}})^2]}}.
% \end{equation*}
% We chose IPA as a performance measure because it is proper,
% incorporates both discrimination and calibration, and is easy to
% interpret as it measures the relative performance gain compared to
% the null model which does not use any baseline information. The
% definition of IPA involves the uncensored survival time \( T \),
% which is not available in practice. However, in the numerical
% studies, this quantity is available because we know the
% data-generating mechanism used to generate \( T \). In practice, we
% Monte Carlo approximate the IPA by generating a large
% (\( n = 20,000 \)) independent data set of uncensored survival
% times, and calculate the empirical version of the IPA in there.}
\end{itemize}


\begin{itemize}
\item P10. The SurvSL model should be described in more detail.

Answer notes: Do this in the simulation setup?

\item P10. For the 'second aim,' it's suggested that an advantage of the
joint survival learner may be that it is a discrete super
learner. This warrants more explanation—why is this an advantage? Is
there more risk of overfitting in small samples?

Draft answer: This is an interesting point. To our knowledge, the
finite sample performance of a discrete versus continuous (ensemble)
super learner is not well understood. In the special case where the
data-generating model is included as a learner in the library, we
think that a discrete super learner could have an advantage, because
it is forced to pick one model from the library, and will with good
change pick the correct one, while an ensemble learner will always
be a mixture of the correct model and a mis-specified one. We have
expanded on this and tried to clarify that this only a possible
explanation and not a strict fact.

Todo: add something to the manuscript.
\end{itemize}

Section 7:

\begin{itemize}
\item P11. The prostate cancer study seems like an afterthought. It would
be beneficial to reference it more when introducing the problem to
demonstrate practical relevance.

Todo TAG.

\item P11. The splitting into training and test data seems wasteful. Could
nested cross-validation be used instead?

Todo: Try it out and then decide.

\item P11. More discussion of the results is needed. What exactly do we
learn from this practical use case?

Answer notes: Todo: ask chatgpt: prompt could you help us answer the
reviewers request: here is the paragraph of our paper copy-paste

\item P11. The usefulness of this manuscript for practical researchers
would be greatly enhanced with a link to a code supplement.

\answer{A code supplement is provided at the Github repository that is
  referenced at the end of the Introduction, please also see our
  answer to you comment to Section 4, page 6.}
\end{itemize}


Section 8:

\begin{itemize}
\item P12. The stated drawback—that the authors evaluate the loss of
learners at the level of the observed data distribution while the
target is either the event-time distribution, censoring
distribution, or both—needs more detailed explanation. Are there
alternatives to this approach, and what would be their drawbacks?

  \answer{We have addressed this partly in our answer to Reviewer 1's
    first comment, please see above. We briefly mention alternative
    approaches in Section 3, and we now reiterate and expand on these
    points in the Discussion, please see the paragraph below which we
    have added to the Discussion.}

  \qrev{
  Alternatives to using a performance measure defined with respect the
  observed data are the use of IPCW loss functions, censoring unbiased
  transformations, or pseudo-values. As mentioned in
  Section~3, the drawback of these approaches is
  that they all need a pre-specified estimator of the censoring
  distribution, and hence these methods are not immediately applicable
  if we do not in advance know how to model the censoring
  distribution. We note that for the special case where the partial
  log-likelihood loss can be used, this loss function, like our
  suggested approach, also measures performance with respect to a
  feature defined by the observed data distribution (e.g., Hjort, 1992;
Whitney et al., 2019).
  \citep[e.g.,][]{hjort1992inference,whitney2019comment}. We do not know
  of any method that would allow us to evaluate performance of a
  risk-prediction model in censored data without either modeling
  additional nuisance parameters (such as the censoring distribution) or
  measuring performance directly with respect to the observed data.
  }
\end{itemize}


\begin{itemize}
\item P12. The authors claim that targeted learning is also known as
debiased machine learning.  However, these are often presented as
distinct approaches. This should be clarified.

\answer{This is a fair point. We have updated the text accordingly:}

\qold{
A relevant application of the joint survival super learner is within
the framework of targeted learning \citep{van2011targeted}, also known
as debiased machine learning \citep{chernozhukov2018double}, -- a
general methodology that combines flexible, data-adaptive estimation
of nuisance parameters with asymptotically valid inference for
low-dimensional target parameters.
}

\qrev{ A relevant application of the joint survival super learner is
  within the framework of targeted learning \citep{van2011targeted} or
  debiased machine learning \citep{chernozhukov2018double}, which are
  general methodologies for combining flexible, data-adaptive
  estimation of nuisance parameters with asymptotically valid
  inference for low-dimensional target parameters.  }
\end{itemize}


\begin{itemize}
\item P12. The discussion lacks reflection on the results from sections 6
and 7.

TODO.
\end{itemize}




\section*{References}
\label{sec:orgd31e305}
\renewcommand{\section}[2]{} 
\bibliography{bib.bib}
\end{document}
